bonaventureli/ble_services/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hrs_sdk/main.c
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_lesc_request_handler();
    APP_ERROR_CHECK(err_code);

    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}
#if 0
/*!
 * typedef int (*pfnReadPortCB_t)(eDKPORT port,uint8_t *outBuf, uint32_t size,uint32_t offset)
 * read content from flash/uart
 * @param [out] outBuf: read flash or uart content and write to outBuf
 * @param [in] size: outBuf size .
 * @param [in] offset:  read flash offset position
 * @return 	actual read size from port.
 * Example usage:
 * @verbatim
 * @endverbatim
 */
typedef int (*pfnReadPortCB_t)(uint8_t *outBuf, uint32_t size,uint32_t offset);
/*!
 * typedef int (*pfnWritePortCB_t)(const uint8_t *inBuf, uint32_t size,uint32_t offset)
 * write content to flash or uart
 * @param [in] inBuf: content will be writed to flash or uart.
 * @param [in] size: inBuf size .
 * @param [in] offset:  write to flash offset position
 * @return actual write size to port.
 * Example usage:
 * @verbatim
 * @endverbatim
 */
typedef int (*pfnWritePortCB_t)(const uint8_t *inBuf, uint32_t size,uint32_t offset);
/*!
 *  \struct dkIOs_t
 *  \brief 
 */
typedef struct
{
   pfnWritePortCB_t     uartTxCallback; //write uart callback funtion point
   pfnReadPortCB_t      flashRCallback; //read flash callback funtion point
   pfnWritePortCB_t     flashWCallback; //write flash callback funtion point
} dkIOs_t;
#define SESSION_MAX 1
dkIOs_t IKTK_SessionContain[SESSION_MAX] ={0};
pfnWritePortCB_t   g_uartTxCB = 0;
int ikcmdInitialize(pfnWritePortCB_t inUartTx)
{
    g_uartTxCB = inUartTx;
	  return 0;
}
uint32_t DKCreateSRV(dkIOs_t * pSession)
{
    static uint32_t session_id = 0;
  if (pSession && session_id < SESSION_MAX) {
      ++session_id;
      //ikbleInitialize();
      IKTK_SessionContain[session_id - 1] = *pSession;
      ikcmdInitialize(pSession->uartTxCallback);
      //ingeek_set_callback(pSession->flashRCallback,pSession->flashWCallback,ikif_random_vector_generate);
	  //ikSecuritySetRunningStatus(DK_SYS_INIT);
      return session_id;
  } else {
    return 0;
  }
}
static dkIOs_t g_ios = {0,0,0};

static int storageReadData(uint8_t *outBuf, uint32_t word_count, uint32_t offset)
{
    uint32_t err_code;
    if (NULL == outBuf)
        return 0;

    if ((offset >= 1024) || (word_count + offset > 1024))
        return 0;
        
    err_code = fstorage_data_read(offset, outBuf, word_count);
    if (NRF_SUCCESS != err_code)
    {
        return 0;
    }

    return 0;
}

static int storageWriteData(const uint8_t *inBuf, uint32_t word_count,uint32_t offset)
{
    uint32_t err_code;
    
    if (NULL == inBuf)
        return 0;

    if ((offset >= 1024) || (word_count + offset > 1024))
        return 0;
        
    err_code = fstorage_data_write(offset, inBuf, word_count);
    if (NRF_SUCCESS != err_code)
    {
        return 0;
    }

    return 0;
}
#endif

#if 0
static int ikif_uart_txcb( const uint8_t *msg, uint32_t wlen, uint32_t offset )
{
    int ret;
    //NRF_LOG_INFO("ikif_uart_txcb tx %d bytes", wlen);
    
    ret = m2m_if_UartSendData((uint8_t *)msg, (uint16_t)wlen);
    if (wlen != ret)
    {
        NRF_LOG_WARNING("m2m_if_UartSendData send Failed, req=%d, sended=%d", wlen, ret);
    }
    
    return ret;
}
#endif
/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

		uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
	
		fstorage_data_init(); //change 2018/12/24 lifei
	
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    //sensor_simulator_init();
    conn_params_init();
	
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("started %s",DEVICE_NAME);
    application_timers_start();
    advertising_start(erase_bonds);

		
		#if 0
		fstorage_data_erase(0);
		#endif
		
		#if 1
		ingeek_set_callback(read_CB1,write_CB1,Rand_CB1);
		#else
		ingeek_set_callback(storageReadData,storageWriteData,ikif_random_vector_generate);
		#endif
		ingeek_se_init();
		
		uint8_t status;
		status = ingeek_get_sec_status();
		NRF_LOG_INFO("started %x",status);
		NotifyCallBack(ble_send_notify);
		
		printf("\r\nUART started.\r\n");
    // Enter main loop.
    for (;;)
    {	
        idle_state_handle();
    }
}


